## Load data

In [16]:
titan_url = 'https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv'

In [17]:
import numpy as np
import pandas as pd

In [18]:
df = pd.read_csv(titan_url)
df.head()

   Survived  Pclass  ... Parents/Children Aboard     Fare
0         0       3  ...                       0   7.2500
1         1       1  ...                       0  71.2833
2         1       3  ...                       0   7.9250
3         1       1  ...                       0  53.1000
4         0       3  ...                       0   8.0500

[5 rows x 8 columns]

## Navigation & Selection

In [19]:
df.iloc[1]

Survived                                                                   1
Pclass                                                                     1
Name                       Mrs. John Bradley (Florence Briggs Thayer) Cum...
Sex                                                                   female
Age                                                                       38
Siblings/Spouses Aboard                                                    1
Parents/Children Aboard                                                    0
Fare                                                                 71.2833
Name: 1, dtype: object

In [20]:
df2 = df.set_index(df['Name'])
df2.loc['Mr. Owen Harris Braund']

Survived                                        0
Pclass                                          3
Name                       Mr. Owen Harris Braund
Sex                                          male
Age                                            22
Siblings/Spouses Aboard                         1
Parents/Children Aboard                         0
Fare                                         7.25
Name: Mr. Owen Harris Braund, dtype: object

In [21]:
# conditional selection
df[df['Name'] == 'Mr. Owen Harris Braund']

   Survived  Pclass  ... Parents/Children Aboard  Fare
0         0       3  ...                       0  7.25

[1 rows x 8 columns]

## Statistics

In [22]:
df[df['Sex'] == 'male'].count()

Survived                   573
Pclass                     573
Name                       573
Sex                        573
Age                        573
Siblings/Spouses Aboard    573
Parents/Children Aboard    573
Fare                       573
dtype: int64

Survived                   573
Pclass                     573
Name                       573
Sex                        573
Age                        573
Siblings/Spouses Aboard    573
Parents/Children Aboard    573
Fare                       573
dtype: int64

In [26]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

## Re

In [29]:
# Rename col
# inplace is false by default (and as general note should be!)
df.rename(columns={'Sex':'Gender'})

     Survived  Pclass  ... Parents/Children Aboard     Fare
0           0       3  ...                       0   7.2500
1           1       1  ...                       0  71.2833
2           1       3  ...                       0   7.9250
3           1       1  ...                       0  53.1000
4           0       3  ...                       0   8.0500
..        ...     ...  ...                     ...      ...
882         0       2  ...                       0  13.0000
883         1       1  ...                       0  30.0000
884         0       3  ...                       2  23.4500
885         1       1  ...                       0  30.0000
886         0       3  ...                       0   7.7500

[887 rows x 8 columns]

In [30]:
# replace value
df['Name'].replace('Mr. Owen Harris Braund', 'Mr. X')

0                                                  Mr. X
1      Mrs. John Bradley (Florence Briggs Thayer) Cum...
2                                  Miss. Laina Heikkinen
3            Mrs. Jacques Heath (Lily May Peel) Futrelle
4                                Mr. William Henry Allen
                             ...
882                                 Rev. Juozas Montvila
883                          Miss. Margaret Edith Graham
884                       Miss. Catherine Helen Johnston
885                                 Mr. Karl Howell Behr
886                                   Mr. Patrick Dooley
Name: Name, Length: 887, dtype: object

## Deletion

In [31]:
df.drop('Name',axis=1)

     Survived  Pclass  ... Parents/Children Aboard     Fare
0           0       3  ...                       0   7.2500
1           1       1  ...                       0  71.2833
2           1       3  ...                       0   7.9250
3           1       1  ...                       0  53.1000
4           0       3  ...                       0   8.0500
..        ...     ...  ...                     ...      ...
882         0       2  ...                       0  13.0000
883         1       1  ...                       0  30.0000
884         0       3  ...                       2  23.4500
885         1       1  ...                       0  30.0000
886         0       3  ...                       0   7.7500

[887 rows x 7 columns]

In [42]:
# delete row
# simple trick : assign rest rows to other df
# get all dead : R!P
df2 = df[df['Survived'] == 0]
df2

     Survived  Pclass  ... Parents/Children Aboard     Fare
0           0       3  ...                       0   7.2500
4           0       3  ...                       0   8.0500
5           0       3  ...                       0   8.4583
6           0       1  ...                       0  51.8625
7           0       3  ...                       1  21.0750
..        ...     ...  ...                     ...      ...
880         0       3  ...                       0   7.0500
881         0       3  ...                       5  29.1250
882         0       2  ...                       0  13.0000
884         0       3  ...                       2  23.4500
886         0       3  ...                       0   7.7500

[545 rows x 8 columns]

In [45]:
# drop dupli
df.drop_duplicates(subset=['Sex'],keep='last')

     Survived  Pclass  ... Parents/Children Aboard   Fare
884         0       3  ...                       2  23.45
886         0       3  ...                       0   7.75

[2 rows x 8 columns]

## GroupBy

In [47]:
df.groupby('Sex').sum()

        Survived  Pclass  ...  Parents/Children Aboard        Fare
Sex                       ...
female       233     678  ...                      204  13966.6628
male         109    1367  ...                      136  14688.2449

[2 rows x 6 columns]

## Func

In [58]:
def fn(x):
  return 'नर' if x=='male' else 'महिला'

df['Sex'].apply(fn)

0         नर
1      महिला
2      महिला
3      महिला
4         नर
       ...
882       नर
883    महिला
884    महिला
885       नर
886       नर
Name: Sex, Length: 887, dtype: object

In [59]:
df.groupby('Sex').apply(lambda x : x.count())

        Survived  Pclass  ...  Parents/Children Aboard  Fare
Sex                       ...
female       314     314  ...                      314   314
male         573     573  ...                      573   573

[2 rows x 8 columns]

$ BY Gaurav Kabra $